# Taps
tap 'homebrew/cask'
# tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'bash' # latest bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'sqlite'
brew 'wget'

# Development
brew 'php'
brew 'node'

# Apps
cask 'adobe-acrobat-reader'
cask 'cyberduck'
# cask 'filezilla' // install manually
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'libreoffice'
cask 'nextcloud'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'thunderbird'
# cask 'virtualbox' // didn't work
# cask 'virtualbox-extension-pack' // didn't work
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
# cask 'font-fira-code'
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-raleway'

# Install Mac App Store apps
mas 'Keynote', id: 409183694
mas 'LastPass Password Manager', id: 926036361
mas 'Magnet', id: 441258766
mas 'Sequel Ace', id: 1518036000
mas 'The Unarchiver', id: 425424353
mas 'Toggl Desktop', id: 957734279
mas 'WhatsApp', id: 1147396723
