# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'sqlite'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'mysql'
brew 'node'

# Apps
cask 'adobe-acrobat-reader'
cask 'cheatsheet'
cask 'cyberduck'
cask 'docker'
cask 'filezilla'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'grammarly'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'kitematic'
cask 'libreoffice'
cask 'nextcloud'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sublime-text'
# cask 'teamviewer'
cask 'thunderbird'
# cask 'virtualbox' // didn't work
# cask 'virtualbox-extension-pack' // didn't work
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-raleway'

# Install Mac App Store apps
mas 'Color Picker', id: 945374555
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'The Unarchiver', id: 425424353
mas 'Toggl Desktop', id: 957734279
mas 'WhatsApp', id: 1147396723
